package main

import "fmt"

func main() {
	// var arr [len]type
	// arr := [len]type{data1,data2}
	a := [3]int{1, 2}           // 未初始化元素值为 0
	b := [...]int{1, 2, 3}      // 通过初始化值确定数组长度
	c := [5]int{2: 100, 4: 200} // 通过索引号初始化元素，未初始化元素值为 0
	fmt.Println(a, b, c)        //[1 2 0] [1 2 3] [0 0 100 0 200]

	//支持多维数组
	d := [4][2]int{{10, 11}, {20, 21}, {30, 31}, {40, 41}}
	e := [...][2]int{{10, 11}, {20, 21}, {30, 31}, {40, 41}} //第二维不能写"..."
	f := [4][2]int{1: {20, 21}, 3: {40, 41}}
	g := [4][2]int{1: {0: 20}, 3: {1: 41}}
	fmt.Println(d, e, f, g)
}
